#+title: Rngstream random number generators for C#
#+author: Mark Clements
#+options: toc:nil html-postamble:nil ':t

* Introduction

** RngStream

RngStreams is an object-oriented random-number package with many long streams and substreams,
based on the MRG32k3a RNG from reference [fn:1] below and proposed in [fn:2].

It has implementations in C, C++, Java, R, and some other languages.
The main description and documentation is in the c++ directory, in the paper streams.pdf.
Directories c and java gives a short description of the interfaces in C and Java, respectively.

The package is copyrighted by Pierre L'Écuyer and the University of Montreal.
It can be used freely for any purpose.

E-mail:   [[mailto:lecuyer@iro.umontreal.ca]]

http://www.iro.umontreal.ca/~lecuyer/

If you use it for your research, please cite the relevant publications in which MRG32k3a
and the package with multiple streams were proposed.

** C# implementation

This code is adapted from the Java implementation. The implementation:
 - Inherits from [[https://docs.microsoft.com/en-us/dotnet/api/system.random?view=net-5.0][System.Random]]
 - Constructors:
  - =RngStream()= :: initially use the seed ={12345u,12345u,12345u,12345u,12345u,12345u}= and then subsequently advances to the next stream
  - =RngStream(string name)= :: to set the stream name
  - =RngStream(int seed)= :: with equivalent seed behaviour as R's =set.seed(seed)=.
 - Standard =RngStream= methods:
  - =void SetPackageSeed(uint[])= :: to set the package seed
  - =void ResetStartStream()= :: to reset to the start of the stream
  - =void ResetNextSubstream()= :: to reset to the start of the sub-stream
  - =void SetAntithetic(bool)= :: to determine whether to use antithetic sampling (default=false)
  - =void IncreasedPrecis(bool)= :: to determine whether to use increased precision (default=false)
  - =void SetSeed(uint[])= :: set the stream seeds (note: does not change the package seed)
  - =double[] GetState()= :: returns the current seed
  - =void WriteState()= :: write a brief description to the console
  - =void WriteStateFull()= :: write a full description to the console
 - New methods
  - =void AdvanceState(int e,int c)= :: increment the current seed by \(2^e+c\)
  - =void AdvanceSubstream(int e,int c)= :: increment the substream seed by \(2^e+c\) using substream steps and change the current seed to the same value
  - =void AdvanceStream(int e,int c)= :: increment the current stream by  \(2^e+c\) using stream steps and change the current seed and substream to the same value


* Example

#+BEGIN_SRC elisp :exports none
;;; ob-csharp.el --- org-babel functions for csharp evaluation

;; Copyright (C) 2011-2015 Free Software Foundation, Inc.

;; Original Author: Eric Schulte (ob-java.el) 
;; Author: thomas "at" friendlyvillagers.com 
;; Keywords: literate programming, reproducible research
;; Homepage: http://orgmode.org

;; LOCAL CHANGES: default to "mcs"; add :otherfiles argument for compiling
;; Mark Clements 2021-10-15

;; This file is NOT YET part of GNU Emacs.

;; GNU Emacs is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; GNU Emacs is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;; Currently this only supports the external compilation and execution
;; of csharp code blocks (i.e., no session support).

;;; Code:
(require 'ob)

(defvar org-babel-tangle-lang-exts)
(add-to-list 'org-babel-tangle-lang-exts '("csharp" . "cs"))

(defcustom org-babel-csharp-command "mono"
  "Name of the csharp command.
May be either a command in the path, like mono
or an absolute path name, like /usr/local/bin/mono
parameters may be used, like mono -verbose"
  :group 'org-babel
  :version "24.3"
  :type 'string)

(defcustom org-babel-csharp-compiler "mcs"
  "Name of the csharp compiler.
May be either a command in the path, like mcs
or an absolute path name, like /usr/local/bin/mcs
parameters may be used, like mcs -warnaserror+"
  :group 'org-babel
  :version "24.3"
  :type 'string) 

(defun org-babel-execute:csharp (body params)
  (let* ((full-body (org-babel-expand-body:generic body params))
         (cmpflag (or (cdr (assoc :cmpflag params)) ""))
         (cmdline (or (cdr (assoc :cmdline params)) ""))
         (otherfiles (or (cdr (assoc :otherfiles params)) ""))
         (src-file (org-babel-temp-file "csharp-src-" ".cs"))
         (exe-file (concat (file-name-sans-extension src-file)  ".exe"))
         (compile 
          (progn (with-temp-file  src-file (insert full-body))
                 (org-babel-eval 
                  (concat org-babel-csharp-compiler " " cmpflag " "  src-file " " otherfiles) ""))))
    (let ((results (org-babel-eval (concat org-babel-csharp-command " " cmdline " " exe-file) "")))
      (org-babel-reassemble-table
       (org-babel-result-cond (cdr (assoc :result-params params))
         (org-babel-read results)
         (let ((tmp-file (org-babel-temp-file "c-")))
           (with-temp-file tmp-file (insert results))
           (org-babel-import-elisp-from-file tmp-file)))
       (org-babel-pick-name
        (cdr (assoc :colname-names params)) (cdr (assoc :colnames params)))
       (org-babel-pick-name
        (cdr (assoc :rowname-names params)) (cdr (assoc :rownames params)))))))

(defun org-babel-prep-session:csharp (session params)
  "Return an error because csharp does not support sessions."
  (error "Sessions are not (yet) supported for CSharp"))

(provide 'ob-csharp)
;;; ob-csharp.el ends here
#+END_SRC

Using C# and the =RngStream.cs= file:

#+BEGIN_SRC csharp :results verbatim :otherfiles RngStream.cs :exports both
  using System;
  class HelloWorld {
      public static void Main()
      {
	  RngStream rng1 = new RngStream(); // defaults to {12345u,12345u,12345u,12345u,12345u,12345u}
	  Console.WriteLine(rng1.NextDouble()+" "+rng1.NextDouble());
	  RngStream rng2 = new RngStream(12345);
	  Console.WriteLine(rng2.NextDouble()+" "+rng2.NextDouble());
	  rng2.ResetNextSubstream();
	  Console.WriteLine(rng2.NextDouble()+" "+rng2.NextDouble());
	  rng2.ResetNextStream();
	  Console.WriteLine(rng2.NextDouble()+" "+rng2.NextDouble());
      }
  }
#+END_SRC

#+RESULTS:
: 0.127011122046577 0.318527565396794
: 0.0724408950348632 0.769887841571279
: 0.698103786494021 0.186421477183622
: 0.485965335294788 0.15088750221408

Equivalent code in R:

#+BEGIN_SRC R :results output :exports both
  library(parallel)
  RNGkind("L'Ecuyer-CMRG")
  ## Note that 407 is the index for this type of random number generator
  .Random.seed <- c(407L,12345L,12345L,12345L,12345L,12345L,12345L)
  print(runif(2))
  set.seed(12345)
  Ig <- Bg <- .Random.seed
  print(runif(2))
  .Random.seed <- Bg <- parallel::nextRNGSubStream(Bg)
  print(runif(2))
  .Random.seed <- Ig <- Bg <- parallel::nextRNGStream(Ig)
  print(runif(2))
#+END_SRC

#+RESULTS:
: [1] 0.1270111 0.3185276
: [1] 0.0724409 0.7698878
: [1] 0.6981038 0.1864215
: [1] 0.4859653 0.1508875


[fn:1] P. L'Ecuyer, "Good Parameter Sets for Combined Multiple Recursive Random Number Generators",
Operations Research, 47, 1 (1999), 159--164.

[fn:2] P. L'Ecuyer, R. Simard, E. J. Chen, and W. D. Kelton,
"An Objected-Oriented Random-Number Package with Many Long Streams and Substreams",
Operations Research, 50, 6 (2002), 1073--1075

